# Analyzing CIA factbook using SQL

## The aim is to obtain some basic information from the database
- Minimum population.
- Maximum population.
- Minimum population growth.
- Maximum population growth.
- Countrie(s) with the minimum population.
- Countrie(s) with the maximum population.
- Find the average population.
- Find the average area.
- Find the countries which..
    - Has population above average.
    - Has area  below average.
- Which countries have the highest ratios of water to land? Which countries have more water than land?
- Which countries will add the most people to their population next year?
- Which countries have a higher death rate than birth rate?

### Analysis Outline
1. Import all the libraries needed
2. Create the connection
3. Create a sql querry that will search for all the tables in the database
4. Read the querry created above into pandas.
5. Inspect to see what are the tables in the database.
6. Select the table of interest and display some few rows to get the overview of the dataset

In [3]:
#import all the libraries needed
import sqlite3
import pandas as pd

In [2]:
#Create the connection instances
conn =  sqlite3.connect('factbook.db')

In [4]:
tables = '''
            SELECT
                *
            FROM sqlite_master 
            WHERE type ="table";'''

In [5]:
table_factbook = pd.read_sql_query(tables, conn)

In [6]:
table_factbook

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

### Observation:
- There are two tables:
- We will use the table called facts

In [12]:
querry_facts = '''
                  SELECT
                      *
                    FROM facts
                    LIMIST 5;
                    
                    '''
pd.read_sql_query(querry_facts,conn)

DatabaseError: Execution failed on sql '
                  SELECT
                      *
                    FROM facts
                    LIMIST 5;

                    ': near "5": syntax error

In [10]:
pd.read_sql_query(querry_facts,conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230.0,652230.0,0.0,3.256434e+07,2.32,38.57,13.89,1.51
1,2,al,Albania,28748.0,27398.0,1350.0,3.029278e+06,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741.0,2381741.0,0.0,3.954217e+07,1.84,23.67,4.31,0.92
3,4,an,Andorra,468.0,468.0,0.0,8.558000e+04,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700.0,1246700.0,0.0,1.962535e+07,2.78,38.78,11.49,0.46
...,...,...,...,...,...,...,...,...,...,...,...
256,257,zh,Atlantic Ocean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
257,258,xo,Indian Ocean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
258,259,zn,Pacific Ocean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
259,260,oo,Southern Ocean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
260,261,xx,World,NaN,NaN,NaN,7.256490e+09,1.08,18.60,7.80,NaN